{
    "availability": {
        "availabilityfulltime": "",
        "availabilitywhen": "",
        "update": "2020-02-21T15:35:02.374Z"
    },
    "basics": {
        "email": "contact+1366163@talao.io",
        "firstname": "Bill",
        "label": "",
        "location": {
            "address": "",
            "city": "",
            "countryCode": "",
            "postalCode": "",
            "region": ""
        },
        "name": "Hoesly",
        "phone": "",
        "picture": "",
        "profiles": [
            {
                "network": "",
                "url": "",
                "username": ""
            }
        ],
        "summary": "Results driven leader with over ten years experience as a strategic planner  decision maker  operations manager  and trainer. Proven success in devising and implementing innovative solutions to a wide range of problems. Focused on creating sustainable competitive advantage  delivering superior customer satisfaction  and driving growth with an eye toward the bottom line. Skilled at building and leading strong work teams aligned on common goals. Creative thinker and problem solver who works well under pressure. Corporate and military management experience. M.S. in Administration. Specialties: Leader  manager  decision maker  financial management  resource management personnel management  employee evaluation quality assurance ",
        "website": "https://www.linkedin.com/in/bill-hoesly-72b55a"
    },
    "did": {
        "address": "0xAFFd63BD020C921C79fdED0d0FfB821DA998258e",
        "chain": "rinkeby",
        "protocol": "ERC725",
        "subprotocol": "TALAO",
        "url": "http://vault.talao.io:4011/visit/0x0a826872fAC84482F67E5558cCE8bD743b2CF483"
    },
    "education": [
        {
            "area": " ",
            "endDate": "2000-01-01",
            "institution": "Central Michigan University",
            "startDate": "2000-01-01",
            "studyType": "MSA"
        },
        {
            "area": " ",
            "endDate": "2000-01-01",
            "institution": "University of Wisconsin",
            "startDate": "2000-01-01",
            "studyType": "BBA"
        }
    ],
    "languages": [],
    "mobility": {
        "mobilityareas": false,
        "mobilityareaslist": [],
        "mobilityinternational": false,
        "mobilityremote": false
    },
    "rate": {
        "ratecurrency": "",
        "rateprice": ""
    },
    "skills": [
        {
            "keywords": [],
            "level": "",
            "name": ""
        }
    ],
    "work": [
        {
            "company": "Patt-White GMAC",
            "endDate": "Current",
            "highlights": [],
            "position": "Realtor",
            "startDate": "",
            "summary": "",
            "website": ""
        },
        {
            "company": "Patt-White GMAC",
            "endDate": "2004-05-01",
            "position": "Realtor",
            "startDate": "2004-05-01",
            "summary": "Realtor Independent contractor  licensed to sell residential and commercial real estate.",
            "website": ""
        },
        {
            "company": "American Airlines",
            "endDate": "2003-03-01",
            "position": "Pilot",
            "startDate": "1990-02-01",
            "summary": "PILOT Licensed in 5 different aircraft types to carry passengers and cargo. Annually evaluated and flight certified. Coordinated and managed logistics for all flights including: flight planning  fuel requirements  weather evaluation  and maintenance review. · Individualized flight instructions for each crewmember to ensure full and proper compliance. · Clarified plans for emergency situations to each crewmember to ensure safety and a clear understanding of correct procedures. · Oversaw correction of maintenance problems to insure on time departure and landing  safety  and air worthiness of aircraft to include: coordinating with company operations to reschedule flights  re-filing route clearances with air traffic control  and briefing passengers on flight issues. · Managed medical emergency decisions by coordinating with crew to assess passenger medical condition  devising plans of action  selecting diversion airfields  and coordinating ground medical support.",
            "website": ""
        },
        {
            "company": "U.S. Air Force",
            "endDate": "1990-01-01",
            "position": "Air Force Officer/Pilot",
            "startDate": "1972-12-01",
            "summary": "Led and managed employees and corporate sized resource management office with international responsibility. Managed corporate operations centers with international scope. Designed  administered  and oversaw employee training programs  and evaluated employees and organizations. Oversaw and monitored corporate financial programs. Qualified in international air transport of passengers and cargo. Annually evaluated by U.S. government for international flight certification. · Operated an Air Force Reserve Augmentation Employment Program with annual budget of $173 000. Approved all hiring  duration of employment  and disbursement of funds. Forecast fiscal year program requirements and budget. · Controlled 150 to 200 transport aircraft globally and a supporting logistics system as supervisor of a military operations center  ensuring on time  safe operation of all military transport aircraft.",
            "website": ""
        }
    ]
}